app/views/api/todo_lists/show.json.jbuilder

SELECT  "todos".* FROM "todos" WHERE "todos"."todo_list_id" = ?  ORDER BY created_at DESC LIMIT 10 OFFSET 0  [["todo_list_id", 10]]
SELECT COUNT(*) FROM "todos" WHERE "todos"."todo_list_id" = ?  [["todo_list_id", 10]]
---
json.name  @todo_list.name
json.todos @todo_list.todos.page(1) do |todo|